l1 = [34, 45, 23, 81, 28, 11]
l2 = [11, 45, 22, 81, 23, 34, 99, 22, 17, 8]
l3 = [1, 1, 1, 1, 1, 0, 0, 0, 0, 0]


def partition(A, l, r):
    # l : 작업 시작 인덱스
    # r : 작업 종료 인덱스

    #  l ~ r 범위에 있는 원소중에서 기준을 정하기
    # 맨 앞에 있는 원소를 기준으로 하자.
    p = A[l]

    # 기준원소 p보다 작은애들은 앞쪽으로
    # 기준원소 p보다 큰 애들은 뒤쪽으로

    # 왼쪽에서 시작해서 p보다 큰애들을 찾고
    # 오른쪽에서 시작해서 p보다 작은애들을 찾음
    # 그 두명의 자리를 교환하는 것을 반복

    # 왼쪽에서 큰애들을 찾기 위한 인덱스
    # 1씩 증가 하며 검색, 찾으면 멈춘다.
    i = l
    # 오른쪽에서 작은애들을 찾기 위한 인덱스
    # 1씩 감소 하며 검색, 찾으면 멈춘다.
    j = r

    # i와 j가 교차 하는 순간
    # 앞쪽에 작은애들이 잘 모여 있고, 뒤쪽에 큰애들이 잘 모여 있는 상태가 됨

    while i <= j:
        # i는 왼쪽에서 1씩 증가하며 큰애를찾고, 찾으면 멈춘다.
        while i <= j and A[i] <= p:
            i += 1
        # j는 오른쪽에서 1씩 감소하며 작은애를 찾고, 찾으면 멈춘다.
        while i <= j and A[j] >= p:
            j -= 1

        # 위의 두개의 while 문이 종료가 되면
        # i와j는 작은애와 큰애를 찾은것이다. 또는 교차했거나..
        if i < j:
            # i가 여전히 j보다 작으면 둘중에 하나가 멈췄다.(자리 잘못된 애를 찾았다)
            # 자리를 교환해준다.
            A[i], A[j] = A[j], A[i]

    # 반복이 종료되면 i와 j가 교차했다. => 작은애들 앞에 잘 모았고, 큰애들은 뒤에 잘 모았다.
    # 교차하는순간 작은애들이 연속, 큰애들이 연속했으니까 그 사이에 기준 원소를 끼워넣으면 된다.
    # 끼워넣을때 작은 원소랑 위치를 바꿔야 원래 모양이 유지가 된다.
    A[l], A[j] = A[j], A[l]

    # 기준원소의 위치는 j로 확정
    return j


def quick_sort(A, l, r):
    if l < r:
        # 기준원소 자리 확정 후
        p = partition(A, l, r)
        # 기준원소의 나머지 왼쪽 부분 정렬
        quick_sort(A, l, p - 1)
        # 기준원소의 나머지 오른쪽 부분 정렬
        quick_sort(A, p + 1, r)

quick_sort(l1, 0, len(l1)-1)
quick_sort(l2, 0, len(l2)-1)
quick_sort(l3, 0, len(l3)-1)

print(l1)
print(l2)
print(l3)