
# 가중치가 최소인 간선을 빨리 찾기 위한 최소 힙 사용
from heapq import heappop, heappush

# V : 정점의 개수, E : 간선의 개수
V, E = map(int, input().split())

# 그래프 인접 리스트
G = [[] for _ in range(V)]

for i in range(E):
    # 한줄에 입력 3개 => 정점1(s) 정점2(e) 가중치(w)
    s, e, w = map(int, input().split())
    # 가중치가 있는 그래프의 경우 인접리스트 생성 방법 # 정점번호랑 가중치까지 묶어서
    G[s].append((e,w))
    G[e].append((s,w))

"""
1. 시작 정점(임의의 정점)을 결정해서 거기서부터 신장트리를 만들기 시작
2. 내가 지금까지 골랐던 정점들과 인접하는 정점중에 최소 가중치를 가진 간선을 선택 <=이게 탐욕적인 알고리즘이다
    (조건: 이전에 선택한적 없는 정점과 이어진 간선)
3. 위의 과정을 MST가 만들어질 때까지 반복
"""

# s: 시작 정점 번호
def prim(s):
    # 우선순위큐 (최소힙)
    heap = []
    # 중복체크
    # MST[1] = 1 : 1번 정점은 MST에 현재 포함되어있다 (이전에 1번 정점을 선택했다)
    # MST[2] = 0 : 2번 정점은 MST에 포함되어있지 않다. (이전에 2번 정점을 선택하지 않았다)
    MST = [0] * V

    # 최소비용
    MIN = 0

    # 선택을 몇번했는지 기억해서 MST의 완성 유무를 체크
    cnt = 0

    # 힙에 시작정점 정보를 넣고 추가(가중치, 정점번호)  # 기준이 되는 값을 앞으로 빼야 리스트, 튜플 정렬 가능
    # 힙의 우선순위 선정 기준은 튜플의 첫번째 원소, 시작정점의 가중치는 0에서 시작
    heappush(heap, (0, s))

    # 가중치가 최소인 간선을 선택하는 일을 반복
    # 선택한 정점의 개수가 총 정점의 개수보다 작으면 아직 완성X
    while cnt < V and heap:
        # W : 가중치 V : 정점번호
        W, v = heappop(heap)

        # 내가 현재 선택가능한 간선중에 최소값을 찾아야 하지만 heap 사용하면 pop만 해도 최소 가중치를 가진 간선 정보가 나온다.

        # 내가 예전에 V번 정점으로 가는 최소 가중치 간선을 선택했다면, 중복선택 안됨, 건너뜀
        if MST[v]:
            continue
        # V를 선택
        MST[v] = 1

        # 가중치 합
        MIN += W

        # 선택 횟수 +1
        cnt += 1

        # V를 추가했으니, V에서 선택할 수 있는 새로운 간선 정보들도 우선순위큐에 추가
        for nv, nw in G[v]:
            # nv : v에서 갈수 있는 새로운 정점 번호
            # nw : 그때 가중치

            # 이때 nv가 내가 예전에 선택한적 있는 정점 번호면 추가할 필요 없다
            if MST[nv]:
                continue

            # v => nv로 가는 간선 정보 우선순위큐에 추가
            heappush(heap, (nw, nv))
    return MIN

# 형태는 다르더라도 어디서 시작하든 MST값은 항상 같다
print(f"MST 최소 가중치 합 : {prim(0)}")
print(f"MST 최소 가중치 합 : {prim(4)}")
